MusaMahmood/nRF52_GSR_ADS1220/main.c
#define CONN_CFG_TAG 1 /**< A tag that refers to the BLE stack configuration we set with @ref sd_ble_cfg_set. Default tag is @ref BLE_CONN_CFG_TAG_DEFAULT. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(5000) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY APP_TIMER_TICKS(30000) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT 3                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define HVN_TX_QUEUE_SIZE 32 //16

#define SEC_PARAM_BOND 1                               /**< Perform bonding. */
#define SEC_PARAM_MITM 0                               /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC 0                               /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS 0                           /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES BLE_GAP_IO_CAPS_NONE /**< No I/O capabilities. */
#define SEC_PARAM_OOB 0                                /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE 7                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE 16                      /**< Maximum encryption key size. */

#define DEAD_BEEF 0xDEADBEEF /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID; /**< Handle of the current connection. */
static nrf_ble_gatt_t m_gatt;                            /**< GATT module instance. */

static ble_uuid_t m_adv_uuids[] =
    {
        {BLE_UUID_SG_MEASUREMENT_SERVICE, BLE_UUID_TYPE_BLE},
#if defined(BLE_BAS_ENABLED) && BLE_BAS_ENABLED == 1
        {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_BLE},
#endif
        {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}}; /**< Universally unique service identifiers. */

static void advertising_start(void);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
static void m_sampling_timeout_handler(void *p_context) {
  UNUSED_PARAMETER(p_context);
}
#endif

//#if defined(BLE_BAS_ENABLED) && BLE_BAS_ENABLED == 1

static void battery_level_update(void) {
// CALL SAADC
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  //Enable load switch:
  nrf_gpio_pin_clear(BATTERY_LOAD_SWITCH_CTRL_PIN);
  //Sample with ADC
  nrf_drv_saadc_sample();
#endif
}

#if defined(FATFS_ENABLED) && FATFS_ENABLED == 1
void fatfs_file_init(void) {
  FRESULT ff_result; 
  NRF_LOG_INFO("Opening File " FILE_NAME_GSR "... \r\n"); 
  ff_result = f_open(&file_gsr, FILE_NAME_GSR, FA_READ | FA_WRITE | FA_OPEN_APPEND);
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Unable to open or create file: " FILE_NAME_GSR ".\r\n");
    NRF_LOG_INFO("ERRCODE: %d\r\n", ff_result);
    return;
  }
  m_fatfs_init = true;
}

void fatfs_file_uninit(void) {
  NRF_LOG_INFO("Closing File " FILE_NAME_GSR "... \r\n"); 
  m_fatfs_init = false;
  (void) f_close(&file_gsr);
}

void fatfs_write_data_gsr(uint8_t data_type) {
  FRESULT ff_result; 
  //--
  uint32_t bytes_written; 
  if (data_type == 2)
    ff_result = f_write(&file_gsr, &m_sg.sg_ch1_buffer[0], SG_PACKET_LENGTH, (UINT *)&bytes_written);
  else
    ff_result = f_write(&file_gsr, &m_sg.sg_ch2_buffer[0], SG_PACKET_LENGTH, (UINT *)&bytes_written);
  total_bytes_written += bytes_written;
  if (ff_result != FR_OK) {
    NRF_LOG_INFO("Write failed\r\n.");
  } else {
    NRF_LOG_INFO("%d bytes written || TOTAL: %d\r\n", bytes_written, total_bytes_written);
  }
  //--
  (void) f_sync(&file_gsr);
}

#endif

static void battery_level_meas_timeout_handler(void *p_context) {
  UNUSED_PARAMETER(p_context);
  battery_level_update();
}
//#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void) {
  // Initialize timer module..
  //Create timers
  ret_code_t err_code = app_timer_init();
  APP_ERROR_CHECK(err_code);

#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  err_code = app_timer_create(&m_sampling_timer_id, APP_TIMER_MODE_REPEATED, m_sampling_timeout_handler);
  APP_ERROR_CHECK(err_code);
#endif

  //#if defined(BLE_BAS_ENABLED) && BLE_BAS_ENABLED == 1
  err_code = app_timer_create(&m_battery_timer_id,
      APP_TIMER_MODE_REPEATED,
      battery_level_meas_timeout_handler);
  APP_ERROR_CHECK(err_code);
  //#endif
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
  ret_code_t err_code;
  ble_gap_conn_params_t gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
  err_code = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME,
      strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void) {
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void) {
  uint32_t err_code;
  /**@Device Information Service:*/
  ble_sg_service_init(&m_sg);

