MusaMahmood/nRF52_GSR_ADS1220/main.c
  NRF_LOG_INFO("Starting advertising.\r\n");

  ret_code_t err_code = sd_ble_gap_adv_start(&adv_params, CONN_CFG_TAG);
  APP_ERROR_CHECK(err_code);
}

#if defined(FATFS_ENABLED) && FATFS_ENABLED == 1
static void fatfs_init(void) {
  static FATFS fs;
  static DIR dir;
  static FILINFO fno;
  //

  //  uint32_t bytes_written;
  FRESULT ff_result;
  DSTATUS disk_state = STA_NOINIT;

  // Initialize FATFS disk I/O interface by providing the block device.
  static diskio_blkdev_t drives[] =
      {
          DISKIO_BLOCKDEV_CONFIG(NRF_BLOCKDEV_BASE_ADDR(m_block_dev_sdc, block_dev), NULL)};

  diskio_blockdev_register(drives, ARRAY_SIZE(drives));

  NRF_LOG_INFO("Initializing disk 0 (SDC)...\r\n");
  for (uint32_t retries = 3; retries && disk_state; --retries) {
    disk_state = disk_initialize(0);
  }
  if (disk_state) {
    NRF_LOG_INFO("Disk initialization failed.\r\n");
    NRF_LOG_INFO("Make sure disk is properly formatted (FAT32).\r\n");
    return;
  }

  uint32_t blocks_per_mb = (1024uL * 1024uL) / m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_size;
  uint32_t capacity = m_block_dev_sdc.block_dev.p_ops->geometry(&m_block_dev_sdc.block_dev)->blk_count / blocks_per_mb;
  NRF_LOG_INFO("Capacity: %d MB\r\n", capacity);

  NRF_LOG_INFO("Mounting volume...\r\n");
  ff_result = f_mount(&fs, "", 1);
  if (ff_result) {
    NRF_LOG_INFO("Mount failed.\r\n");
    return;
  }

  NRF_LOG_INFO("\r\n Listing directory: /\r\n");
  ff_result = f_opendir(&dir, "/");
  if (ff_result) {
    NRF_LOG_INFO("Directory listing failed!\r\n");
    return;
  }

  do {
    ff_result = f_readdir(&dir, &fno);
    if (ff_result != FR_OK) {
      NRF_LOG_INFO("Directory read failed.");
      return;
    }

    if (fno.fname[0]) {
      if (fno.fattrib & AM_DIR) {
        NRF_LOG_RAW_INFO("   <DIR>   %s\r\n", (uint32_t)fno.fname);
      } else {
        NRF_LOG_RAW_INFO("%9lu  %s\r\n", fno.fsize, (uint32_t)fno.fname);
      }
    }
  } while (fno.fname[0]);
  NRF_LOG_RAW_INFO("\r\n");
}
#endif

#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1

void saadc_callback(nrf_drv_saadc_evt_t const *p_event) {
  if (p_event->type == NRF_DRV_SAADC_EVT_DONE) {
    ret_code_t err_code;
    err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    int i;

    int sum = 0;
    for (i = 0; i < SAMPLES_IN_BUFFER; i++) {
      sum += p_event->data.done.p_buffer[i];
    }
    NRF_LOG_INFO("%d\r\n", sum / 4);
    //Transmit via BLuetooth.
    int16_t sum_short = (int16_t)(sum / 4);
    m_bas.battery_level = p_event->data.done.p_buffer[3];
    err_code = ble_bas_battery_level_update(&m_bas);
    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != NRF_ERROR_RESOURCES) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
      APP_ERROR_HANDLER(err_code);
    }
    //Transmit Packet:
    nrf_gpio_pin_set(BATTERY_LOAD_SWITCH_CTRL_PIN); //LOAD SWITCH OFF
  }
}

void saadc_init(void) {
  ret_code_t err_code;
  nrf_drv_saadc_config_t saadc_config;
  // SAADC Configuration:
  saadc_config.low_power_mode = true;                     //Enable low power mode.
  saadc_config.resolution = NRF_SAADC_RESOLUTION_12BIT;   //Set SAADC resolution to 12-bit. This will make the SAADC output values from 0 (when input voltage is 0V) to 2^12=2048 (when input voltage is 3.6V for channel gain setting of 1/6).
  saadc_config.oversample = NRF_SAADC_OVERSAMPLE_4X;      //Set oversample to 4x. This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times.
  saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW; //Set SAADC interrupt to low priority.

  nrf_saadc_channel_config_t channel_config =
      NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);

  err_code = nrf_drv_saadc_init(&saadc_config, saadc_callback);
  APP_ERROR_CHECK(err_code);

  err_code = nrf_drv_saadc_channel_init(0, &channel_config);
  APP_ERROR_CHECK(err_code);

  if (SAADC_BURST_MODE) {
    NRF_SAADC->CH[0].CONFIG |= 0x01000000; //Configure burst mode for channel 0. Burst is useful together with oversampling. When triggering the SAMPLE task in burst mode, the SAADC will sample "Oversample" number of times as fast as it can and then output a single averaged value to the RAM buffer. If burst mode is not enabled, the SAMPLE task needs to be triggered "Oversample" number of times to output a single averaged value to the RAM buffer.
  }

  err_code = nrf_drv_saadc_buffer_convert(&m_buffer_pool[0], SAMPLES_IN_BUFFER);
  APP_ERROR_CHECK(err_code);

  //  err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAMPLES_IN_BUFFER);
  //  APP_ERROR_CHECK(err_code);

  nrf_drv_saadc_calibrate_offset(); //Calibrate before initialization.
}
#endif

static void wait_for_event(void) {
  (void)sd_app_evt_wait();
}

void drdy_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action) {
  UNUSED_PARAMETER(pin);
  UNUSED_PARAMETER(action);

  get_data_gsr_temp(&m_sg, ch_mode);

  if (m_sg.sg_ch1_count == SG_PACKET_LENGTH) { // mode 2
    m_sg.sg_ch1_count = -1;
    if (m_connected) {
      ble_sg_update_1ch(&m_sg);
    } else {
      if (m_fatfs_init) {
//        fatfs_write_data_gsr(2);
      }
    }
    // Switch to mode 1:
    ch_mode = 1;
    ads1220_init_temp_regs(); // Write default registers
    ads1220_start_sync();     // start converting in continuous mode
  }

  if (m_sg.sg_ch2_count == SG_PACKET_LENGTH) { // mode 1 (temp)
    m_sg.sg_ch2_count = -1;
    if (m_connected) {
      ble_sg_update_2ch(&m_sg);
    } else {
//      fatfs_write_data_gsr(1);
    }
    // Switch to mode 2:
    ch_mode = 2;
    ads1220_init_default_regs(); // Write default registers
    ads1220_start_sync();        // start converting in continuous mode
  }
}

static void ads1220_gpio_init(void) {
  nrf_gpio_pin_dir_set(ADS1220_DRDY_PIN, NRF_GPIO_PIN_DIR_INPUT);
  uint32_t err_code;
  if (!nrf_drv_gpiote_is_init()) {
    err_code = nrf_drv_gpiote_init();
  }
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_init: %d\r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  bool is_high_accuracy = true;
  nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(is_high_accuracy);
  in_config.is_watcher = true;
  in_config.pull = NRF_GPIO_PIN_NOPULL;
  err_code = nrf_drv_gpiote_in_init(ADS1220_DRDY_PIN, &in_config, drdy_pin_handler);
  NRF_LOG_RAW_INFO(" nrf_drv_gpiote_in_init: %d: \r\n", err_code);
  NRF_LOG_FLUSH();
  APP_ERROR_CHECK(err_code);
  nrf_drv_gpiote_in_event_enable(ADS1220_DRDY_PIN, true);
}

/**@brief Function for application main entry.
 */
int main(void) {
  bool erase_bonds = false;
  uint32_t err_code = NRF_SUCCESS;
  // Initialize.
  log_init();
  timers_init();
  ble_stack_init();
  ads1220_gpio_init();
  gap_params_init();
  gatt_init();
  advertising_init();
  services_init();
  conn_params_init();
  m_sg.sg_ch1_count = 0;
  m_sg.sg_ch2_count = 0;
  m_sg.sg_ch1_buffer[0] = 0xFF; // <Starting Marker for New Recording> 0xFFFF followed by 58 zero-bytes
  m_sg.sg_ch1_buffer[1] = 0xFF;
  // ADS1220 Functions:
  ads_spi_init();
  ads1220_reset();              // Reset to ensure device is properly working
  ads1220_init_default_regs();  // Write default registers
  ads1220_check_written_regs(); //Sanity Check. Dump written registers
  ads1220_start_sync();         // start converting in continuous mode
// Wait for DRDY.
#if defined(SAADC_ENABLED) && SAADC_ENABLED == 1
  saadc_init();
#endif
  // AD5242 Init:
  ad5242_twi_init(m_twi);
  ad5242_write_rdac1_value(m_twi, 0xF0);
//  ad5242_twi_uninit(m_twi);
#if defined(FATFS_ENABLED) && FATFS_ENABLED == 1
// Setup FATFS on SPI2:
  fatfs_init();
  fatfs_file_init();
  fatfs_write_data_gsr(2); // Write Starting Frame.
#endif
  // Start execution.
  application_timers_start(); // ONCE CALIBRATION IS COMPLETE!
  advertising_start();
  NRF_LOG_RAW_INFO(" BLE Advertising Start! \r\n");
  NRF_LOG_FLUSH();
#if LEDS_ENABLE == 1
  nrf_gpio_pin_clear(LED_2); // Green
  nrf_gpio_pin_set(LED_1);   //Blue
#endif
#if defined(APP_TIMER_SAMPLING) && APP_TIMER_SAMPLING == 1
  m_samples = 0;
#endif
// Enter main loop
#if NRF_LOG_ENABLED == 1
  while (1) {
    NRF_LOG_FLUSH();
  }
#endif
}

/**
 * @}
 */